freebsd/openlaunchd/launchd/src/SystemStarter.8
.Dd April 12, 2002
.Dt SystemStarter 8 
.Os Darwin
.Sh NAME
.Nm SystemStarter
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd Start, stop, and restart system services
.Sh SYNOPSIS
.Nm
.Op Fl gvxdDqn
.Op Ar action Op Ar service
.Sh DESCRIPTION
The 
.Nm 
utility may be used to start, stop, and restart the system services which
are described in the
.Pa /Library/StartupItems/
and
.Pa /System/Library/StartupItems/
paths.
.Pp
The optional
.Ar action
argument specifies which action 
.Nm
performs on the startup items.  The optional
.Ar service
argument specifies which startup items to perform the action on.  If no
.Ar service
is specified, all startup items will be acted on; otherwise, only the item providing the 
.Ar service ,
any items it requires, or any items that depend on it will be acted on.
.Pp
During boot 
.Nm
is invoked by
.Nm rc
(see rc(8)) and is responsible for
starting all startup items in an order that satisfies each item's 
requirements.
.Sh ACTIONS
.Bl -tag -width -indent
.It Nm start
start all items, or start the item that provides the specified
.Ar service
and all items providing services it requires.
.It Nm stop
stop all items, or stop the item that provides the specified
.Ar service
and all items that depend on it.
.It Nm restart
restart all items, or restart the item providing the specified
.Ar service .
.El
.Sh OPTIONS
.Bl -tag -width -indent
.It Fl g
graphical startup
.It Fl v
verbose (text mode) startup
.It Fl x
safe mode startup (only run Apple-provided items)
.It Fl r
keep running after last startup item completes, in graphical startup only
.It Fl d
print debugging output
.It Fl D
print debugging output and dependencies
.It Fl q
be quiet (disable debugging output)
.It Fl n
don't actually perform action on items (no-run mode)
.El
.Sh NOTES
Unless an explicit call to
.Nm ConsoleMessage
is made,
.Nm
examines the exit status of the startup item scripts to determine the success or failure of the services provided by that script.
.Pp
In Darwin it is preferable to create custom startup items than to modify
.Nm rc ,
and at some point
.Nm
may entirely encompass the role of
.Nm rc .
.Sh FILES
.Bl -tag -width -/System/Library/StartupItems -compact
.It Pa /Library/StartupItems/
User-installed startup items.
.It Pa /System/Library/StartupItems/
System-provided startup items.
.El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr ConsoleMessage 8
.Pp
.Xr rc 8
.Pp
http://www.opensource.apple.com/projects/documentation/howto/html/SystemStarter_HOWTO.html
.\" .Sh BUGS              \" Document known, unremedied bugs 
.Sh HISTORY
The
.Nm
utility appeared in Darwin 1.0
.Pp
.Nm
was extended in Darwin 6.0 to support partial startup and interprocess communication.
